<a href="https://colab.research.google.com/github/Ritika-Rana/SpeechToTextConversion/blob/main/sample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
d=[['Ritika',8.5],['Esha',8.3],['Kanchan',8],['Riddhi',8.5]]

In [ ]:
df=pd.DataFrame(d,columns=['Name','CGPA'])

In [ ]:
df

      Name  CGPA
0   Ritika   8.5
1     Esha   8.3
2  Kanchan   8.0
3   Riddhi   8.5

In [ ]:
d1=df.sort_values(by='CGPA')

In [ ]:
d1

      Name  CGPA
2  Kanchan   8.0
1     Esha   8.3
0   Ritika   8.5
3   Riddhi   8.5

In [ ]:
d2=df.sort_values(['CGPA','Name'],ascending=[True,False])
d2

      Name  CGPA
2  Kanchan   8.0
1     Esha   8.3
0   Ritika   8.5
3   Riddhi   8.5

In [ ]:
model{
    
}